# 下面编写代码，通过while循环计算出水仙花数。
# 提示：水仙花数是一个三位数，三位数各位的立方之和等于三位数本身。 
# 下页给出的只是参考代码，你可以自由发挥。计算出的水仙花数有 
# 4个：153、370、371和407。

# for i in range(1,10):
#     for j in range(10):
#         for k in range(10):
#             if i**3+j**3+k**3==i*100+j*10+k:
#                 print (i*100+j*10+k)    

# by me
# i=100
# while i<=999:
    # print(i)
    # print(i//100) # 百位
    # print(i%100//10) # 十位
    # print(i%100%10) # 个位
    # if i == (i//100)**3+(i%100//10)**3+(i%100%10)**3:
    #     print(i)
    # i+=1
# by book

i = 100; r=0;s=0;t=0
while i<1000:
    r=i//100
    s=(i-r*100)//10
    t=i-r*100-s*10
    if i == (r**3 + s**3 + t**3):
        print("i = "+str(i))
    i +=1